exercise3/channelStep/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0.5 0)
    (0 1 0)
    (0.5 1 0)
    (0.5 0.5 0)
    (0.5 0 0)
    (5 0 0)
    (5 1 0)
    (5 0.5 0)

    (0 0.5 1)
    (0 1 1)
    (0.5 1 1)
    (0.5 0.5 1)
    (0.5 0 1)
    (5 0 1)
    (5 1 1)
    (5 0.5 1)
);

blocks
(
    hex (0 3 2 1 8 11 10 9) (40 40 1) simpleGrading (1 1 1)
    hex (3 7 6 2 11 15 14 10) (360 40 1) simpleGrading (1 1 1)
    hex (4 5 7 3 12 13 15 11) (360 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inflowWall
    {
        type wall;
        faces
        (
            (0 1 8 9)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
            (1 2 9 10)
            (2 10 6 14)
            (0 3 8 11)
            (3 11 4 12)
            (4 12 5 13)
        );
    }

    outflowWall
    {
        type wall;
	faces
	(
	    (6 7 14 15)
	    (5 7 13 15)
	);
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 2 3 1)
	    (8 10 11 9)
            (3 2 6 7)
            (4 3 7 5)
            (11 10 14 15)
            (12 11 15 13)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
